# Auther hr.Sun
# 函数操作
  #  area_of_circle(x) 求圆的面积
  #  abs 求绝对值的函数(有且仅有1个参数)
  #  max() 求最大值  可以接收任意多个参数，并返回最大的那个



# abs 函数 求绝对值的函数
abs(100) # 100
abs(-20) # 20
abs(12.34) # 12.34
print(abs(125.46)) # 125.46
#  max() 求最大值
maxValue = max(1,2,3,9,7,4)
print(maxValue)


# 圆的面积 S = πr2
# s = area_of_circle(x)
r1 = 12.34
r2 = 9.08
r3 = 73.1
s1 = 3.14 * r1 * r1
s2 = 3.14 * r2 * r2
s3 = 3.14 * r3 * r3
print(r1)
print(r2)
print(r3)

# 抽象
# 计算数列的和，比如：1 + 2 + 3 + ... + 100 ，写起来十分不方便，于是数学家发明了求和符号∑，可以把1 + 2 + 3 + ... + 100记作：
#   100
#   ∑n
#   n=1

#   100
#   ∑(n2+1)
#   n=1
#   还原成加法运算就变成了：(1 x 1 + 1) + (2 x 2 + 1) + (3 x 3 + 1) + ... + (100 x 100 + 1)

